<?php
/**
 * Created by PhpStorm.
 * User: 南丞
 * Date: 2019/4/18
 * Time: 13:28
 *
 *
 *                      _ooOoo_
 *                     o8888888o
 *                     88" . "88
 *                     (| ^_^ |)
 *                     O\  =  /O
 *                  ____/`---'\____
 *                .'  \\|     |//  `.
 *               /  \\|||  :  |||//  \
 *              /  _||||| -:- |||||-  \
 *              |   | \\\  -  /// |   |
 *              | \_|  ''\---/''  |   |
 *              \  .-\__  `-`  ___/-. /
 *            ___`. .'  /--.--\  `. . ___
 *          ."" '<  `.___\_<|>_/___.'  >'"".
 *        | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *        \  \ `-.   \_ __\ /__ _/   .-` /  /
 *  ========`-.____`-.___\_____/___.-`____.-'========
 *                       `=---='
 *  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *           佛祖保佑       永无BUG     永不修改
 *
 */
// redis 乐观锁实现秒杀功能

$redis = new Redis();
$redis->connect('127.0.0.1', 6379);
$redis->auth('pfinal');
$cachekey = $redis->get("cachekey");
$number = 100;
if ($cachekey < $number) {
    $redis->watch('cachekey');
    $redis->multi();

    // 设置延迟
    sleep(5);
    // 插入抢购数据
    $redis->hSet("cachekeyList","user_id_".mt_rand(1,9999),time());

}